/*
Кто я? Что я? Почему так звенит в голове? Может как всегда пара шестерёнок отвалилась и катается туда-сюда?

Я на космическом корабле, как и полагается пилоту, но не помню как сюда попал. Помню весёлую компанию в кабаке космопорта,
 помню шикарных робо-див,  много выпивки и темнота. Сейчас я на мостике, кто-то меня сюда принес.

Осмотреть рубку. deckhouse

Подсказка 1
Ну, если вам на этом шаге нужна подсказка, то лучше наверное повторить азы SQL
Подсказка 2
Ладно-ладно, может просто непонятно что тут и как, чтобы осмотреться введите SELECT и далее, как вам подскажет фантазия.
 Таблицы и возможные параметры, которые вы можете вводить выделяются в тексте code
Подсказка 3
Ну что вы как маленький. SELECT * FROM deckhouse
*/

SELECT * FROM deckhouse

/*
Было сложно, но вы справились!

Query result:
+----+----------------+
| id | name           |
+----+----------------+
| 1  | radio          |
| 2  | coffee_machine |
| 3  | notes          |
| 4  | window         |
| 5  | keys           |
| 6  | armchair       |
| 7  | contract       |
| 8  | star_atlas     |
| 9  | computer       |
+----+----------------+
Affected rows: 9
*/
